kcuzner/teensy-oscilloscope/scope-teensy/include/MK63F12WS.h
/* CAU - Peripheral instance base addresses */
/** Peripheral CAU base pointer */
#define CAU_BASE_PTR                             ((CAU_MemMapPtr)0xE0081000u)
/** Array initializer of CAU peripheral base pointers */
#define CAU_BASE_PTRS                            { CAU_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- CAU - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAU_Register_Accessor_Macros CAU - Register accessor macros
 * @{
 */


/* CAU - Register instance definitions */
/* CAU */
#define CAU_DIRECT0                              CAU_DIRECT_REG(CAU_BASE_PTR,0)
#define CAU_DIRECT1                              CAU_DIRECT_REG(CAU_BASE_PTR,1)
#define CAU_DIRECT2                              CAU_DIRECT_REG(CAU_BASE_PTR,2)
#define CAU_DIRECT3                              CAU_DIRECT_REG(CAU_BASE_PTR,3)
#define CAU_DIRECT4                              CAU_DIRECT_REG(CAU_BASE_PTR,4)
#define CAU_DIRECT5                              CAU_DIRECT_REG(CAU_BASE_PTR,5)
#define CAU_DIRECT6                              CAU_DIRECT_REG(CAU_BASE_PTR,6)
#define CAU_DIRECT7                              CAU_DIRECT_REG(CAU_BASE_PTR,7)
#define CAU_DIRECT8                              CAU_DIRECT_REG(CAU_BASE_PTR,8)
#define CAU_DIRECT9                              CAU_DIRECT_REG(CAU_BASE_PTR,9)
#define CAU_DIRECT10                             CAU_DIRECT_REG(CAU_BASE_PTR,10)
#define CAU_DIRECT11                             CAU_DIRECT_REG(CAU_BASE_PTR,11)
#define CAU_DIRECT12                             CAU_DIRECT_REG(CAU_BASE_PTR,12)
#define CAU_DIRECT13                             CAU_DIRECT_REG(CAU_BASE_PTR,13)
#define CAU_DIRECT14                             CAU_DIRECT_REG(CAU_BASE_PTR,14)
#define CAU_DIRECT15                             CAU_DIRECT_REG(CAU_BASE_PTR,15)
#define CAU_LDR_CASR                             CAU_LDR_CASR_REG(CAU_BASE_PTR)
#define CAU_LDR_CAA                              CAU_LDR_CAA_REG(CAU_BASE_PTR)
#define CAU_LDR_CA0                              CAU_LDR_CA_REG(CAU_BASE_PTR,0)
#define CAU_LDR_CA1                              CAU_LDR_CA_REG(CAU_BASE_PTR,1)
#define CAU_LDR_CA2                              CAU_LDR_CA_REG(CAU_BASE_PTR,2)
#define CAU_LDR_CA3                              CAU_LDR_CA_REG(CAU_BASE_PTR,3)
#define CAU_LDR_CA4                              CAU_LDR_CA_REG(CAU_BASE_PTR,4)
#define CAU_LDR_CA5                              CAU_LDR_CA_REG(CAU_BASE_PTR,5)
#define CAU_LDR_CA6                              CAU_LDR_CA_REG(CAU_BASE_PTR,6)
#define CAU_LDR_CA7                              CAU_LDR_CA_REG(CAU_BASE_PTR,7)
#define CAU_LDR_CA8                              CAU_LDR_CA_REG(CAU_BASE_PTR,8)
#define CAU_STR_CASR                             CAU_STR_CASR_REG(CAU_BASE_PTR)
#define CAU_STR_CAA                              CAU_STR_CAA_REG(CAU_BASE_PTR)
#define CAU_STR_CA0                              CAU_STR_CA_REG(CAU_BASE_PTR,0)
#define CAU_STR_CA1                              CAU_STR_CA_REG(CAU_BASE_PTR,1)
#define CAU_STR_CA2                              CAU_STR_CA_REG(CAU_BASE_PTR,2)
#define CAU_STR_CA3                              CAU_STR_CA_REG(CAU_BASE_PTR,3)
#define CAU_STR_CA4                              CAU_STR_CA_REG(CAU_BASE_PTR,4)
#define CAU_STR_CA5                              CAU_STR_CA_REG(CAU_BASE_PTR,5)
#define CAU_STR_CA6                              CAU_STR_CA_REG(CAU_BASE_PTR,6)
#define CAU_STR_CA7                              CAU_STR_CA_REG(CAU_BASE_PTR,7)
#define CAU_STR_CA8                              CAU_STR_CA_REG(CAU_BASE_PTR,8)
#define CAU_ADR_CASR                             CAU_ADR_CASR_REG(CAU_BASE_PTR)
#define CAU_ADR_CAA                              CAU_ADR_CAA_REG(CAU_BASE_PTR)
#define CAU_ADR_CA0                              CAU_ADR_CA_REG(CAU_BASE_PTR,0)
#define CAU_ADR_CA1                              CAU_ADR_CA_REG(CAU_BASE_PTR,1)
#define CAU_ADR_CA2                              CAU_ADR_CA_REG(CAU_BASE_PTR,2)
#define CAU_ADR_CA3                              CAU_ADR_CA_REG(CAU_BASE_PTR,3)
#define CAU_ADR_CA4                              CAU_ADR_CA_REG(CAU_BASE_PTR,4)
#define CAU_ADR_CA5                              CAU_ADR_CA_REG(CAU_BASE_PTR,5)
#define CAU_ADR_CA6                              CAU_ADR_CA_REG(CAU_BASE_PTR,6)
#define CAU_ADR_CA7                              CAU_ADR_CA_REG(CAU_BASE_PTR,7)
#define CAU_ADR_CA8                              CAU_ADR_CA_REG(CAU_BASE_PTR,8)
#define CAU_RADR_CASR                            CAU_RADR_CASR_REG(CAU_BASE_PTR)
#define CAU_RADR_CAA                             CAU_RADR_CAA_REG(CAU_BASE_PTR)
#define CAU_RADR_CA0                             CAU_RADR_CA_REG(CAU_BASE_PTR,0)
#define CAU_RADR_CA1                             CAU_RADR_CA_REG(CAU_BASE_PTR,1)
#define CAU_RADR_CA2                             CAU_RADR_CA_REG(CAU_BASE_PTR,2)
#define CAU_RADR_CA3                             CAU_RADR_CA_REG(CAU_BASE_PTR,3)
#define CAU_RADR_CA4                             CAU_RADR_CA_REG(CAU_BASE_PTR,4)
#define CAU_RADR_CA5                             CAU_RADR_CA_REG(CAU_BASE_PTR,5)
#define CAU_RADR_CA6                             CAU_RADR_CA_REG(CAU_BASE_PTR,6)
#define CAU_RADR_CA7                             CAU_RADR_CA_REG(CAU_BASE_PTR,7)
#define CAU_RADR_CA8                             CAU_RADR_CA_REG(CAU_BASE_PTR,8)
#define CAU_XOR_CASR                             CAU_XOR_CASR_REG(CAU_BASE_PTR)
#define CAU_XOR_CAA                              CAU_XOR_CAA_REG(CAU_BASE_PTR)
#define CAU_XOR_CA0                              CAU_XOR_CA_REG(CAU_BASE_PTR,0)
#define CAU_XOR_CA1                              CAU_XOR_CA_REG(CAU_BASE_PTR,1)
#define CAU_XOR_CA2                              CAU_XOR_CA_REG(CAU_BASE_PTR,2)
#define CAU_XOR_CA3                              CAU_XOR_CA_REG(CAU_BASE_PTR,3)
#define CAU_XOR_CA4                              CAU_XOR_CA_REG(CAU_BASE_PTR,4)
#define CAU_XOR_CA5                              CAU_XOR_CA_REG(CAU_BASE_PTR,5)
#define CAU_XOR_CA6                              CAU_XOR_CA_REG(CAU_BASE_PTR,6)
#define CAU_XOR_CA7                              CAU_XOR_CA_REG(CAU_BASE_PTR,7)
#define CAU_XOR_CA8                              CAU_XOR_CA_REG(CAU_BASE_PTR,8)
#define CAU_ROTL_CASR                            CAU_ROTL_CASR_REG(CAU_BASE_PTR)
#define CAU_ROTL_CAA                             CAU_ROTL_CAA_REG(CAU_BASE_PTR)
#define CAU_ROTL_CA0                             CAU_ROTL_CA_REG(CAU_BASE_PTR,0)
#define CAU_ROTL_CA1                             CAU_ROTL_CA_REG(CAU_BASE_PTR,1)
#define CAU_ROTL_CA2                             CAU_ROTL_CA_REG(CAU_BASE_PTR,2)
#define CAU_ROTL_CA3                             CAU_ROTL_CA_REG(CAU_BASE_PTR,3)
#define CAU_ROTL_CA4                             CAU_ROTL_CA_REG(CAU_BASE_PTR,4)
#define CAU_ROTL_CA5                             CAU_ROTL_CA_REG(CAU_BASE_PTR,5)
#define CAU_ROTL_CA6                             CAU_ROTL_CA_REG(CAU_BASE_PTR,6)
#define CAU_ROTL_CA7                             CAU_ROTL_CA_REG(CAU_BASE_PTR,7)
#define CAU_ROTL_CA8                             CAU_ROTL_CA_REG(CAU_BASE_PTR,8)
#define CAU_AESC_CASR                            CAU_AESC_CASR_REG(CAU_BASE_PTR)
#define CAU_AESC_CAA                             CAU_AESC_CAA_REG(CAU_BASE_PTR)
#define CAU_AESC_CA0                             CAU_AESC_CA_REG(CAU_BASE_PTR,0)
#define CAU_AESC_CA1                             CAU_AESC_CA_REG(CAU_BASE_PTR,1)
#define CAU_AESC_CA2                             CAU_AESC_CA_REG(CAU_BASE_PTR,2)
#define CAU_AESC_CA3                             CAU_AESC_CA_REG(CAU_BASE_PTR,3)
#define CAU_AESC_CA4                             CAU_AESC_CA_REG(CAU_BASE_PTR,4)
#define CAU_AESC_CA5                             CAU_AESC_CA_REG(CAU_BASE_PTR,5)
#define CAU_AESC_CA6                             CAU_AESC_CA_REG(CAU_BASE_PTR,6)
#define CAU_AESC_CA7                             CAU_AESC_CA_REG(CAU_BASE_PTR,7)
#define CAU_AESC_CA8                             CAU_AESC_CA_REG(CAU_BASE_PTR,8)
#define CAU_AESIC_CASR                           CAU_AESIC_CASR_REG(CAU_BASE_PTR)
#define CAU_AESIC_CAA                            CAU_AESIC_CAA_REG(CAU_BASE_PTR)
#define CAU_AESIC_CA0                            CAU_AESIC_CA_REG(CAU_BASE_PTR,0)
#define CAU_AESIC_CA1                            CAU_AESIC_CA_REG(CAU_BASE_PTR,1)
#define CAU_AESIC_CA2                            CAU_AESIC_CA_REG(CAU_BASE_PTR,2)
#define CAU_AESIC_CA3                            CAU_AESIC_CA_REG(CAU_BASE_PTR,3)
#define CAU_AESIC_CA4                            CAU_AESIC_CA_REG(CAU_BASE_PTR,4)
#define CAU_AESIC_CA5                            CAU_AESIC_CA_REG(CAU_BASE_PTR,5)
#define CAU_AESIC_CA6                            CAU_AESIC_CA_REG(CAU_BASE_PTR,6)
#define CAU_AESIC_CA7                            CAU_AESIC_CA_REG(CAU_BASE_PTR,7)
#define CAU_AESIC_CA8                            CAU_AESIC_CA_REG(CAU_BASE_PTR,8)

/* CAU - Register array accessors */
#define CAU_DIRECT(index)                        CAU_DIRECT_REG(CAU_BASE_PTR,index)
#define CAU_LDR_CA(index)                        CAU_LDR_CA_REG(CAU_BASE_PTR,index)
#define CAU_STR_CA(index)                        CAU_STR_CA_REG(CAU_BASE_PTR,index)
#define CAU_ADR_CA(index)                        CAU_ADR_CA_REG(CAU_BASE_PTR,index)
#define CAU_RADR_CA(index)                       CAU_RADR_CA_REG(CAU_BASE_PTR,index)
#define CAU_XOR_CA(index)                        CAU_XOR_CA_REG(CAU_BASE_PTR,index)
#define CAU_ROTL_CA(index)                       CAU_ROTL_CA_REG(CAU_BASE_PTR,index)
#define CAU_AESC_CA(index)                       CAU_AESC_CA_REG(CAU_BASE_PTR,index)
#define CAU_AESIC_CA(index)                      CAU_AESIC_CA_REG(CAU_BASE_PTR,index)

/*!
 * @}
 */ /* end of group CAU_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group CAU_Peripheral */


/* ----------------------------------------------------------------------------
   -- CMP
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CMP_Peripheral CMP
 * @{
 */

/** CMP - Peripheral register structure */
typedef struct CMP_MemMap {
  uint8_t CR0;                                     /**< CMP Control Register 0, offset: 0x0 */
  uint8_t CR1;                                     /**< CMP Control Register 1, offset: 0x1 */
  uint8_t FPR;                                     /**< CMP Filter Period Register, offset: 0x2 */
  uint8_t SCR;                                     /**< CMP Status and Control Register, offset: 0x3 */
  uint8_t DACCR;                                   /**< DAC Control Register, offset: 0x4 */
  uint8_t MUXCR;                                   /**< MUX Control Register, offset: 0x5 */
} volatile *CMP_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- CMP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CMP_Register_Accessor_Macros CMP - Register accessor macros
 * @{
 */


/* CMP - Register accessors */
#define CMP_CR0_REG(base)                        ((base)->CR0)
#define CMP_CR1_REG(base)                        ((base)->CR1)
#define CMP_FPR_REG(base)                        ((base)->FPR)
#define CMP_SCR_REG(base)                        ((base)->SCR)
#define CMP_DACCR_REG(base)                      ((base)->DACCR)
#define CMP_MUXCR_REG(base)                      ((base)->MUXCR)

/*!
 * @}
 */ /* end of group CMP_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- CMP Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CMP_Register_Masks CMP Register Masks
 * @{
 */

/* CR0 Bit Fields */
#define CMP_CR0_HYSTCTR_MASK                     0x3u
#define CMP_CR0_HYSTCTR_SHIFT                    0
#define CMP_CR0_HYSTCTR(x)                       (((uint8_t)(((uint8_t)(x))<<CMP_CR0_HYSTCTR_SHIFT))&CMP_CR0_HYSTCTR_MASK)
#define CMP_CR0_FILTER_CNT_MASK                  0x70u
#define CMP_CR0_FILTER_CNT_SHIFT                 4
#define CMP_CR0_FILTER_CNT(x)                    (((uint8_t)(((uint8_t)(x))<<CMP_CR0_FILTER_CNT_SHIFT))&CMP_CR0_FILTER_CNT_MASK)
/* CR1 Bit Fields */
#define CMP_CR1_EN_MASK                          0x1u
#define CMP_CR1_EN_SHIFT                         0
#define CMP_CR1_OPE_MASK                         0x2u
#define CMP_CR1_OPE_SHIFT                        1
#define CMP_CR1_COS_MASK                         0x4u
#define CMP_CR1_COS_SHIFT                        2
#define CMP_CR1_INV_MASK                         0x8u
#define CMP_CR1_INV_SHIFT                        3
#define CMP_CR1_PMODE_MASK                       0x10u
#define CMP_CR1_PMODE_SHIFT                      4
#define CMP_CR1_WE_MASK                          0x40u
#define CMP_CR1_WE_SHIFT                         6
#define CMP_CR1_SE_MASK                          0x80u
#define CMP_CR1_SE_SHIFT                         7
/* FPR Bit Fields */
#define CMP_FPR_FILT_PER_MASK                    0xFFu
#define CMP_FPR_FILT_PER_SHIFT                   0
#define CMP_FPR_FILT_PER(x)                      (((uint8_t)(((uint8_t)(x))<<CMP_FPR_FILT_PER_SHIFT))&CMP_FPR_FILT_PER_MASK)
/* SCR Bit Fields */
#define CMP_SCR_COUT_MASK                        0x1u
#define CMP_SCR_COUT_SHIFT                       0
#define CMP_SCR_CFF_MASK                         0x2u
#define CMP_SCR_CFF_SHIFT                        1
#define CMP_SCR_CFR_MASK                         0x4u
#define CMP_SCR_CFR_SHIFT                        2
#define CMP_SCR_IEF_MASK                         0x8u
#define CMP_SCR_IEF_SHIFT                        3
#define CMP_SCR_IER_MASK                         0x10u
#define CMP_SCR_IER_SHIFT                        4
#define CMP_SCR_DMAEN_MASK                       0x40u
#define CMP_SCR_DMAEN_SHIFT                      6
/* DACCR Bit Fields */
#define CMP_DACCR_VOSEL_MASK                     0x3Fu
#define CMP_DACCR_VOSEL_SHIFT                    0
#define CMP_DACCR_VOSEL(x)                       (((uint8_t)(((uint8_t)(x))<<CMP_DACCR_VOSEL_SHIFT))&CMP_DACCR_VOSEL_MASK)
#define CMP_DACCR_VRSEL_MASK                     0x40u
#define CMP_DACCR_VRSEL_SHIFT                    6
#define CMP_DACCR_DACEN_MASK                     0x80u
#define CMP_DACCR_DACEN_SHIFT                    7
/* MUXCR Bit Fields */
#define CMP_MUXCR_MSEL_MASK                      0x7u
#define CMP_MUXCR_MSEL_SHIFT                     0
#define CMP_MUXCR_MSEL(x)                        (((uint8_t)(((uint8_t)(x))<<CMP_MUXCR_MSEL_SHIFT))&CMP_MUXCR_MSEL_MASK)
#define CMP_MUXCR_PSEL_MASK                      0x38u
#define CMP_MUXCR_PSEL_SHIFT                     3
#define CMP_MUXCR_PSEL(x)                        (((uint8_t)(((uint8_t)(x))<<CMP_MUXCR_PSEL_SHIFT))&CMP_MUXCR_PSEL_MASK)
#define CMP_MUXCR_PSTM_MASK                      0x80u
#define CMP_MUXCR_PSTM_SHIFT                     7

/*!
 * @}
 */ /* end of group CMP_Register_Masks */


/* CMP - Peripheral instance base addresses */
/** Peripheral CMP0 base pointer */
#define CMP0_BASE_PTR                            ((CMP_MemMapPtr)0x40073000u)
/** Peripheral CMP1 base pointer */
#define CMP1_BASE_PTR                            ((CMP_MemMapPtr)0x40073008u)
/** Peripheral CMP2 base pointer */
#define CMP2_BASE_PTR                            ((CMP_MemMapPtr)0x40073010u)
/** Array initializer of CMP peripheral base pointers */
#define CMP_BASE_PTRS                            { CMP0_BASE_PTR, CMP1_BASE_PTR, CMP2_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- CMP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CMP_Register_Accessor_Macros CMP - Register accessor macros
 * @{
 */


/* CMP - Register instance definitions */
/* CMP0 */
#define CMP0_CR0                                 CMP_CR0_REG(CMP0_BASE_PTR)
#define CMP0_CR1                                 CMP_CR1_REG(CMP0_BASE_PTR)
#define CMP0_FPR                                 CMP_FPR_REG(CMP0_BASE_PTR)
#define CMP0_SCR                                 CMP_SCR_REG(CMP0_BASE_PTR)
#define CMP0_DACCR                               CMP_DACCR_REG(CMP0_BASE_PTR)
#define CMP0_MUXCR                               CMP_MUXCR_REG(CMP0_BASE_PTR)
/* CMP1 */
#define CMP1_CR0                                 CMP_CR0_REG(CMP1_BASE_PTR)
#define CMP1_CR1                                 CMP_CR1_REG(CMP1_BASE_PTR)
#define CMP1_FPR                                 CMP_FPR_REG(CMP1_BASE_PTR)
#define CMP1_SCR                                 CMP_SCR_REG(CMP1_BASE_PTR)
#define CMP1_DACCR                               CMP_DACCR_REG(CMP1_BASE_PTR)
#define CMP1_MUXCR                               CMP_MUXCR_REG(CMP1_BASE_PTR)
/* CMP2 */
#define CMP2_CR0                                 CMP_CR0_REG(CMP2_BASE_PTR)
#define CMP2_CR1                                 CMP_CR1_REG(CMP2_BASE_PTR)
#define CMP2_FPR                                 CMP_FPR_REG(CMP2_BASE_PTR)
#define CMP2_SCR                                 CMP_SCR_REG(CMP2_BASE_PTR)
#define CMP2_DACCR                               CMP_DACCR_REG(CMP2_BASE_PTR)
#define CMP2_MUXCR                               CMP_MUXCR_REG(CMP2_BASE_PTR)

/*!
 * @}
 */ /* end of group CMP_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group CMP_Peripheral */


/* ----------------------------------------------------------------------------
   -- CMT
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CMT_Peripheral CMT
 * @{
 */

/** CMT - Peripheral register structure */
typedef struct CMT_MemMap {
  uint8_t CGH1;                                    /**< CMT Carrier Generator High Data Register 1, offset: 0x0 */
  uint8_t CGL1;                                    /**< CMT Carrier Generator Low Data Register 1, offset: 0x1 */
  uint8_t CGH2;                                    /**< CMT Carrier Generator High Data Register 2, offset: 0x2 */
  uint8_t CGL2;                                    /**< CMT Carrier Generator Low Data Register 2, offset: 0x3 */
  uint8_t OC;                                      /**< CMT Output Control Register, offset: 0x4 */
  uint8_t MSC;                                     /**< CMT Modulator Status and Control Register, offset: 0x5 */
  uint8_t CMD1;                                    /**< CMT Modulator Data Register Mark High, offset: 0x6 */
  uint8_t CMD2;                                    /**< CMT Modulator Data Register Mark Low, offset: 0x7 */
  uint8_t CMD3;                                    /**< CMT Modulator Data Register Space High, offset: 0x8 */
  uint8_t CMD4;                                    /**< CMT Modulator Data Register Space Low, offset: 0x9 */
  uint8_t PPS;                                     /**< CMT Primary Prescaler Register, offset: 0xA */
  uint8_t DMA;                                     /**< CMT Direct Memory Access Register, offset: 0xB */
} volatile *CMT_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- CMT - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CMT_Register_Accessor_Macros CMT - Register accessor macros
 * @{
 */


/* CMT - Register accessors */
#define CMT_CGH1_REG(base)                       ((base)->CGH1)
#define CMT_CGL1_REG(base)                       ((base)->CGL1)
#define CMT_CGH2_REG(base)                       ((base)->CGH2)
#define CMT_CGL2_REG(base)                       ((base)->CGL2)
#define CMT_OC_REG(base)                         ((base)->OC)
#define CMT_MSC_REG(base)                        ((base)->MSC)
#define CMT_CMD1_REG(base)                       ((base)->CMD1)
#define CMT_CMD2_REG(base)                       ((base)->CMD2)
#define CMT_CMD3_REG(base)                       ((base)->CMD3)
#define CMT_CMD4_REG(base)                       ((base)->CMD4)
#define CMT_PPS_REG(base)                        ((base)->PPS)
#define CMT_DMA_REG(base)                        ((base)->DMA)

/*!
 * @}
 */ /* end of group CMT_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- CMT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CMT_Register_Masks CMT Register Masks
 * @{
 */

