kcuzner/teensy-oscilloscope/scope-teensy/include/MK63F12WS.h
/* DMA - Register array accessors */
#define DMA_SADDR(index)                         DMA_SADDR_REG(DMA_BASE_PTR,index)
#define DMA_SOFF(index)                          DMA_SOFF_REG(DMA_BASE_PTR,index)
#define DMA_ATTR(index)                          DMA_ATTR_REG(DMA_BASE_PTR,index)
#define DMA_NBYTES_MLNO(index)                   DMA_NBYTES_MLNO_REG(DMA_BASE_PTR,index)
#define DMA_NBYTES_MLOFFNO(index)                DMA_NBYTES_MLOFFNO_REG(DMA_BASE_PTR,index)
#define DMA_NBYTES_MLOFFYES(index)               DMA_NBYTES_MLOFFYES_REG(DMA_BASE_PTR,index)
#define DMA_SLAST(index)                         DMA_SLAST_REG(DMA_BASE_PTR,index)
#define DMA_DADDR(index)                         DMA_DADDR_REG(DMA_BASE_PTR,index)
#define DMA_DOFF(index)                          DMA_DOFF_REG(DMA_BASE_PTR,index)
#define DMA_CITER_ELINKNO(index)                 DMA_CITER_ELINKNO_REG(DMA_BASE_PTR,index)
#define DMA_CITER_ELINKYES(index)                DMA_CITER_ELINKYES_REG(DMA_BASE_PTR,index)
#define DMA_DLAST_SGA(index)                     DMA_DLAST_SGA_REG(DMA_BASE_PTR,index)
#define DMA_CSR(index)                           DMA_CSR_REG(DMA_BASE_PTR,index)
#define DMA_BITER_ELINKNO(index)                 DMA_BITER_ELINKNO_REG(DMA_BASE_PTR,index)
#define DMA_BITER_ELINKYES(index)                DMA_BITER_ELINKYES_REG(DMA_BASE_PTR,index)

/*!
 * @}
 */ /* end of group DMA_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group DMA_Peripheral */


/* ----------------------------------------------------------------------------
   -- DMAMUX
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Peripheral DMAMUX
 * @{
 */

/** DMAMUX - Peripheral register structure */
typedef struct DMAMUX_MemMap {
  uint8_t CHCFG[16];                               /**< Channel Configuration register, array offset: 0x0, array step: 0x1 */
} volatile *DMAMUX_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- DMAMUX - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Register_Accessor_Macros DMAMUX - Register accessor macros
 * @{
 */


/* DMAMUX - Register accessors */
#define DMAMUX_CHCFG_REG(base,index)             ((base)->CHCFG[index])

/*!
 * @}
 */ /* end of group DMAMUX_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- DMAMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Register_Masks DMAMUX Register Masks
 * @{
 */

/* CHCFG Bit Fields */
#define DMAMUX_CHCFG_SOURCE_MASK                 0x3Fu
#define DMAMUX_CHCFG_SOURCE_SHIFT                0
#define DMAMUX_CHCFG_SOURCE(x)                   (((uint8_t)(((uint8_t)(x))<<DMAMUX_CHCFG_SOURCE_SHIFT))&DMAMUX_CHCFG_SOURCE_MASK)
#define DMAMUX_CHCFG_TRIG_MASK                   0x40u
#define DMAMUX_CHCFG_TRIG_SHIFT                  6
#define DMAMUX_CHCFG_ENBL_MASK                   0x80u
#define DMAMUX_CHCFG_ENBL_SHIFT                  7

/*!
 * @}
 */ /* end of group DMAMUX_Register_Masks */


/* DMAMUX - Peripheral instance base addresses */
/** Peripheral DMAMUX base pointer */
#define DMAMUX_BASE_PTR                          ((DMAMUX_MemMapPtr)0x40021000u)
/** Array initializer of DMAMUX peripheral base pointers */
#define DMAMUX_BASE_PTRS                         { DMAMUX_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- DMAMUX - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Register_Accessor_Macros DMAMUX - Register accessor macros
 * @{
 */


/* DMAMUX - Register instance definitions */
/* DMAMUX */
#define DMAMUX_CHCFG0                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,0)
#define DMAMUX_CHCFG1                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,1)
#define DMAMUX_CHCFG2                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,2)
#define DMAMUX_CHCFG3                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,3)
#define DMAMUX_CHCFG4                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,4)
#define DMAMUX_CHCFG5                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,5)
#define DMAMUX_CHCFG6                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,6)
#define DMAMUX_CHCFG7                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,7)
#define DMAMUX_CHCFG8                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,8)
#define DMAMUX_CHCFG9                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,9)
#define DMAMUX_CHCFG10                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,10)
#define DMAMUX_CHCFG11                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,11)
#define DMAMUX_CHCFG12                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,12)
#define DMAMUX_CHCFG13                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,13)
#define DMAMUX_CHCFG14                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,14)
#define DMAMUX_CHCFG15                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,15)

/* DMAMUX - Register array accessors */
#define DMAMUX_CHCFG(index)                      DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,index)

/*!
 * @}
 */ /* end of group DMAMUX_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group DMAMUX_Peripheral */


/* ----------------------------------------------------------------------------
   -- DRY
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DRY_Peripheral DRY
 * @{
 */

/** DRY - Peripheral register structure */
typedef struct DRY_MemMap {
  uint8_t RESERVED_0[4];
  uint32_t SKVR;                                   /**< DryIce Secure Key Valid Register, offset: 0x4 */
  uint32_t SKWLR;                                  /**< DryIce Secure Key Write Lock Register, offset: 0x8 */
  uint32_t SKRLR;                                  /**< DryIce Secure Key Read Lock Register, offset: 0xC */
  uint32_t CR;                                     /**< DryIce Control Register, offset: 0x10 */
  uint32_t SR;                                     /**< DryIce Status Register, offset: 0x14 */
  uint32_t LR;                                     /**< DryIce Lock Register, offset: 0x18 */
  uint32_t IER;                                    /**< DryIce Interrupt Enable Register, offset: 0x1C */
  uint32_t TSR;                                    /**< DryIce Tamper Seconds Register, offset: 0x20 */
  uint32_t TER;                                    /**< DryIce Tamper Enable Register, offset: 0x24 */
  uint32_t PDR;                                    /**< DryIce Pin Direction Register, offset: 0x28 */
  uint32_t PPR;                                    /**< DryIce Pin Polarity Register, offset: 0x2C */
  uint32_t ATR[2];                                 /**< DryIce Active Tamper Register, array offset: 0x30, array step: 0x4 */
  uint8_t RESERVED_1[8];
  uint32_t PGFR[6];                                /**< DryIce Pin Glitch Filter Register, array offset: 0x40, array step: 0x4 */
  uint8_t RESERVED_2[1960];
  uint32_t WAC;                                    /**< DryIce Write Access Control Register, offset: 0x800 */
  uint32_t RAC;                                    /**< DryIce Read Access Control Register, offset: 0x804 */
  uint8_t RESERVED_3[2040];
  uint32_t SKR[8];                                 /**< Secure Key Register, array offset: 0x1000, array step: 0x4 */
  uint8_t RESERVED_4[2016];
  uint32_t SWAC;                                   /**< Secure Write Access Control, offset: 0x1800 */
  uint32_t SRAC;                                   /**< Secure Read Access Control, offset: 0x1804 */
} volatile *DRY_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- DRY - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DRY_Register_Accessor_Macros DRY - Register accessor macros
 * @{
 */


/* DRY - Register accessors */
#define DRY_SKVR_REG(base)                       ((base)->SKVR)
#define DRY_SKWLR_REG(base)                      ((base)->SKWLR)
#define DRY_SKRLR_REG(base)                      ((base)->SKRLR)
#define DRY_CR_REG(base)                         ((base)->CR)
#define DRY_SR_REG(base)                         ((base)->SR)
#define DRY_LR_REG(base)                         ((base)->LR)
#define DRY_IER_REG(base)                        ((base)->IER)
#define DRY_TSR_REG(base)                        ((base)->TSR)
#define DRY_TER_REG(base)                        ((base)->TER)
#define DRY_PDR_REG(base)                        ((base)->PDR)
#define DRY_PPR_REG(base)                        ((base)->PPR)
#define DRY_ATR_REG(base,index)                  ((base)->ATR[index])
#define DRY_PGFR_REG(base,index)                 ((base)->PGFR[index])
#define DRY_WAC_REG(base)                        ((base)->WAC)
#define DRY_RAC_REG(base)                        ((base)->RAC)
#define DRY_SKR_REG(base,index)                  ((base)->SKR[index])
#define DRY_SWAC_REG(base)                       ((base)->SWAC)
#define DRY_SRAC_REG(base)                       ((base)->SRAC)

/*!
 * @}
 */ /* end of group DRY_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- DRY Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DRY_Register_Masks DRY Register Masks
 * @{
 */

